export const ServerMessages = {
  /** Пользователь не найден*/
  USER_NOT_FOUND: "Пользователь не найден",

  /** Неправильный логин или пароль */
  INVALID_CREDENTIALS: "Неправильный логин или пароль",

  /** Пользователь с такими данными уже существует */
  USER_ALREADY_EXISTS: "Пользователь с такими данными уже существует",

  /** Вы успешно вышли с аккаунта */
  LOGOUT_SUCCESSFUL: "Вы успешно вышли с аккаунта",

  /** Эта почта уже используется */
  EMAIL_IN_USE: "Эта почта уже используется",

  /** Токен недействительный или не предоставлен */
  INVALID_TOKEN: "Токен недействительный или не предоставлен",

  /** Вы не авторизованы */
  UNAUTHORIZED: "Вы не авторизованы",

  /** Произошла ошибка при сохранении файлов */
  FILE_SAVE_ERROR: "Произошла ошибка при сохранении файлов",

  /**Необходимо авторизоваться */
  AUTH_REQUIRED: "Необходимо авторизоваться",

  /**Заполните все поля*/
  FILL_ALL_FIELDS: "Заполните все поля",

  /** Заказ не найден */
  ORDER_NOT_FOUND: "Заказ не найден",

  /** Заказы не найден */
  ORDERS_NOT_FOUND: "Заказы не найдены",

  /**Заказ в пути. Для того, чтобы отменить заказ в пути, свяжитесь с техподдержкой */
  ORDER_CANCEL_NOT_AVAILABLE:
    "Заказ в пути. Для того, чтобы отменить заказ в пути, свяжитесь с техподдержкой",

  /** Ошибка при создании заказа */
  ORDER_CREATE_ERROR:
    "Ошибка при создании заказа, возможно недостаточно данных",
};
