const faqData = [
  {
    id: 1,
    question: "Что делать, если курьер опоздал с доставкой?",
    answer:
      "Если курьер задерживается, вы можете связаться с нашей технической поддержкой в Telegram Мы оперативно решим вопрос и уточним причины задержки.",
    link: {
      href: "https://t.me/dealivesupport",
      text: "Техподдержка",
    },
  },
  {
    id: 2,
    question: "Могу ли я отменить заказ после его оформления?",
    answer:
      "Да, вы можете отменить заказ до того, как курьер начнет его выполнение. Для этого свяжитесь с нашей технической поддержкой в Telegram",
    link: {
      href: "https://t.me/dealivesupport",
      text: "Техподдержка",
    },
  },
  {
    id: 4,
    question: "Как рассчитывается стоимость доставки?",
    answer:
      "Стоимость доставки зависит от расстояния, веса и габаритов груза, а также срочности заказа. Вы можете указать удобную для вас сумму, и мы постараемся найти курьера, который готов выполнить заказ на этих условиях. Однако, если предложенная сумма будет слишком низкой, это может затруднить поиск курьера. Мы рекомендуем ориентироваться на средние рыночные цены, чтобы ваш заказ был выполнен быстрее.",
  },
  {
    id: 5,
    question: "Могу ли я заказать доставку в ночное время?",
    answer:
      "Да, курьеры видят заказы круглосуточно. Однако стоимость доставки в ночное время может быть выше из-за маленького количества курьеров на линии.",
  },
  {
    id: 6,
    question: "Что делать, если курьер повредил мой груз?",
    answer:
      "Если груз был поврежден, свяжитесь с нашей техподдержкой в Telegram. Мы проведем расследование и компенсируем ущерб в соответствии с нашими правилами.",
    link: {
      href: "https://t.me/dealivesupport",
      text: "Техподдержка",
    },
  },
  {
    id: 7,
    question: "Могу ли я заказать доставку за пределы Москвы и Подмосковья?",
    answer:
      "На данный момент мы работаем только в пределах Москвы и Подмосковья. Если вам нужно доставить груз в другой регион, свяжитесь с нами, и мы постараемся предложить решение.",
  },

  {
    id: 8,
    question: "Могу ли я заказать доставку для нескольких адресов?",
    answer:
      'Да, мы можем организовать доставку по нескольким адресам. В форме заказа вам нужно нажать кнопку "Добавить адрес"',
  },
  {
    id: 9,
    question: "Как я могу оставить отзыв о вашем сервисе?",
    answer:
      "Вы можете оставить отзыв через техподдержку в Telegram или написать нам на почту dealivehelp@gmail.com. Мы ценим ваше мнение и всегда стремимся улучшить сервис.",
  },
];

export default faqData;
